load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="coordinadora">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Threads">
        <collectionProp name="Arguments.arguments">
          <elementProp name="users" elementType="Argument">
            <stringProp name="Argument.name">users</stringProp>
            <stringProp name="Argument.value">7</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ramps" elementType="Argument">
            <stringProp name="Argument.name">ramps</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="duration" elementType="Argument">
            <stringProp name="Argument.name">duration</stringProp>
            <stringProp name="Argument.value">60</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="ENV">
        <collectionProp name="Arguments.arguments">
          <elementProp name="protocol" elementType="Argument">
            <stringProp name="Argument.name">protocol</stringProp>
            <stringProp name="Argument.value">https</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">apiv2-test.coordinadora.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="name">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">names.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">name</stringProp>
      </CSVDataSet>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="lastName">
        <stringProp name="filename">lastName.csv</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">lastName</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="load testing">
        <stringProp name="ThreadGroup.num_threads">${users}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${ramps}</stringProp>
        <stringProp name="ThreadGroup.duration">${duration}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
          <stringProp name="HTTPSampler.path">/recogidas/cm-solicitud-recogidas-ms/solicitud-recogida</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;tipoEnvio&quot;: &quot;1&quot;,&#xd;
    &quot;tipoProducto&quot;: &quot;4&quot;,&#xd;
    &quot;indicativo&quot;: &quot;57&quot;,&#xd;
    &quot;tipoDocumento&quot;: &quot;13&quot;,&#xd;
    &quot;email&quot;: &quot;ana@gmail.com&quot;,&#xd;
    &quot;personaEntrega&quot;: &quot;1&quot;,&#xd;
    &quot;indicativoEntrega&quot;: &quot;57&quot;,&#xd;
    &quot;medidasAproximadas&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 2,&#xd;
            &quot;tipoPaq&quot;: &quot;Par de zapatos&quot;,&#xd;
            &quot;nombrePaq&quot;: &quot;Par de za...&quot;,&#xd;
            &quot;cantidad&quot;: 1&#xd;
        }&#xd;
    ],&#xd;
    &quot;ciudad&quot;: &quot;Envigado (Ant)&quot;,&#xd;
    &quot;via&quot;: &quot;&quot;,&#xd;
    &quot;numero&quot;: &quot;&quot;,&#xd;
    &quot;detalle&quot;: &quot;PARQUE SAN JOSE BOD 14&quot;,&#xd;
    &quot;tipoVia&quot;: 16,&#xd;
    &quot;nombres&quot;: &quot;prueba&quot;,&#xd;
    &quot;apellidos&quot;: &quot;prueba1&quot;,&#xd;
    &quot;documento&quot;: &quot;1036149000&quot;,&#xd;
    &quot;celular&quot;: &quot;3005777777&quot;,&#xd;
    &quot;ciudadDetalle&quot;: {&#xd;
        &quot;nombre_terminal_operativa&quot;: &quot;Medellin&quot;,&#xd;
        &quot;tipo_servicio&quot;: &quot;A&quot;,&#xd;
        &quot;dane_ciudad&quot;: &quot;05266&quot;,&#xd;
        &quot;dane_actual&quot;: &quot;05266000&quot;,&#xd;
        &quot;ciudad_tarifa&quot;: &quot;05266000&quot;,&#xd;
        &quot;sms&quot;: true,&#xd;
        &quot;cubre_mqp&quot;: true,&#xd;
        &quot;codigo_postal&quot;: &quot;055428&quot;,&#xd;
        &quot;terminal_operativa&quot;: 2,&#xd;
        &quot;cubre_me&quot;: true,&#xd;
        &quot;area_telefono&quot;: 4,&#xd;
        &quot;observaciones2&quot;: &quot;FCE - RD - FD - RCE&quot;,&#xd;
        &quot;codigo&quot;: &quot;05266000&quot;,&#xd;
        &quot;tipo_poblacion&quot;: &quot;D&quot;,&#xd;
        &quot;activo&quot;: true,&#xd;
        &quot;codigo_terminal&quot;: 2,&#xd;
        &quot;codigo_interno&quot;: 204,&#xd;
        &quot;mensajeria&quot;: true,&#xd;
        &quot;cubre_mm&quot;: false,&#xd;
        &quot;departamento&quot;: &quot;05&quot;,&#xd;
        &quot;cubre_cm&quot;: false,&#xd;
        &quot;nombre&quot;: &quot;Envigado (Ant)&quot;,&#xd;
        &quot;abreviado&quot;: &quot;ENVIGADO&quot;,&#xd;
        &quot;nombre_terminal&quot;: &quot;Medellin&quot;,&#xd;
        &quot;observaciones&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;direccion&quot;: &quot;Calle ${__Random(1,100)} # ${__Random(1,100)}-${__Random(1,100)}&quot;,&#xd;
    &quot;fechaRecogida&quot;: &quot;${__timeShift(yyyy-MM-dd,,P${__Random(1,5,)}D,,)}&quot;,&#xd;
    &quot;nombreEntrega&quot;: &quot;${name}&quot;,&#xd;
    &quot;apellidosEntrega&quot;: &quot;${lastName}&quot;,&#xd;
    &quot;celularEntrega&quot;: &quot;3001234567&quot;,&#xd;
    &quot;emailUsuario&quot;: &quot;${name}.${lastName}_test@gmail.com&quot;,&#xd;
    &quot;descripcionTipoVia&quot;: &quot;Calle&quot;,&#xd;
    &quot;aplicativo&quot;: &quot;envios&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">500</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>